loadtest/results/seat-contention.txt
     checks.........................: 100.00% 301 out of 301
     data_received..................: 1.1 MB  116 kB/s
     data_sent......................: 605 kB  62 kB/s
     http_req_blocked...............: avg=1.39ms   min=2.03µs  med=6.27µs   max=54ms    p(90)=4.41ms   p(95)=11.6ms 
     http_req_connecting............: avg=1.26ms   min=0s      med=0s       max=25.45ms p(90)=3.78ms   p(95)=11.28ms
     http_req_duration..............: avg=1.06s    min=1.88ms  med=52.96ms  max=6.14s   p(90)=4.09s    p(95)=5.01s  
       { expected_response:true }...: avg=1.06s    min=1.88ms  med=52.96ms  max=6.14s   p(90)=4.09s    p(95)=5.01s  
     http_req_failed................: 0.00%   0 out of 932
     http_req_receiving.............: avg=800.59µs min=19.38µs med=441.85µs max=9.77ms  p(90)=1.89ms   p(95)=3.62ms 
     http_req_sending...............: avg=318.52µs min=6.3µs   med=28.64µs  max=10.66ms p(90)=354.05µs p(95)=1.02ms 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s      p(90)=0s       p(95)=0s     
     http_req_waiting...............: avg=1.06s    min=1.56ms  med=52.37ms  max=6.13s   p(90)=4.09s    p(95)=5.01s  
     http_reqs......................: 932     95.251541/s
     iteration_duration.............: avg=7.7s     min=6.98s   med=7.48s    max=8.53s   p(90)=8.51s    p(95)=8.52s  
     iterations.....................: 150     15.330184/s
     seat_refused...................: 149     15.227982/s
   ✓ seat_won.......................: 1       0.102201/s
   ✓ unexpected_status..............: 0       0/s
     vus............................: 73      min=0          max=150
     vus_max........................: 150     min=150        max=150


running (0m09.8s), 000/150 VUs, 150 complete and 0 interrupted iterations
stampede ✓ [ 100% ] 150 VUs  0m08.5s/2m0s  150/150 shared iters